---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.WorksetCreatedForLinkWarning
source: html/ad3826c2-1cde-0e01-0bee-f92853fbabd4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.WorksetCreatedForLinkWarning Property

Newly created link types and instances were placed in new workset [workset name]

## Syntax (C#)
```csharp
public static FailureDefinitionId WorksetCreatedForLinkWarning { get; }
```